function [u,X] = FFT1(x,dt,sgn)
%---------------------------------------------
% 程序功能：正反傅里叶变换
%
% 输入参数：
%   x  ---- [1C] 正变换：时间域函数序列(x必须从t=0开始) / 反变换：频率域函数序列(x必须从f=0开始且df=1)
%   dt ---- [0D] 时间采样间隔（注：1/dt必须为偶整数）
%  sgn ---- [0D] 正变换：sgn=1 / 反变换：sgn=-1 
%
% 输出参数：
%   u  ---- [1C] 正变换：u=频率序列f / 反变换：u=时间序列t
%   X  ---- [1C] 傅里叶变换结果
%---------------------------------------------

n = round(1/dt);  df = 1; % 此程序要求频率采样间隔必须为1
if sgn == 1
   X = fft(x,n)*dt;
   X = X(1:length(x));
   u = (0:length(x)-1)'*df;
   
elseif sgn == -1
   y = [x;zeros(n/2-length(x),1)];
   y = [y;0;conj(y(end:-1:2))]; 
   X = ifft(y,n)/dt;
%    X = X(1:length(x));
   u = (0:length(X)-1)'*dt;
   
end

end

